Resources/schemas/Wsdl/SAP_Document_and_Reporting_Compliance-_Electronic_Documents_for_Chile - registroreclamodteservice.WSDL

<?xml version="1.0" encoding="utf-8"?>
<wsdl:definitions targetNamespace="http://ws.registroreclamodte.diii.sdi.sii.cl" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsoap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:http="http://schemas.xmlsoap.org/wsdl/http/" xmlns:mime="http://schemas.xmlsoap.org/wsdl/mime/" xmlns:tns="http://ws.registroreclamodte.diii.sdi.sii.cl" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
 <wsdl:documentation>
  <sidl:sidl xmlns:sidl="http://www.sap.com/2007/03/sidl"/>
 </wsdl:documentation>
 <wsp:UsingPolicy wsdl:required="true"/>
 <wsp:Policy wsu:Id="IF_IF_RegistroReclamoDteService">
  <sapsession:Session xmlns:sapsession="http://www.sap.com/webas/630/soap/features/session/">
   <sapsession:enableSession>false</sapsession:enableSession>
  </sapsession:Session>
 </wsp:Policy>
 <wsp:Policy wsu:Id="OP_IF_OP_consultarDocDteCedible">
  <sapcomhnd:enableCommit xmlns:sapcomhnd="http://www.sap.com/NW05/soap/features/commit/">false</sapcomhnd:enableCommit>
  <sapblock:enableBlocking xmlns:sapblock="http://www.sap.com/NW05/soap/features/blocking/">true</sapblock:enableBlocking>
  <saptrhnw05:required xmlns:saptrhnw05="http://www.sap.com/NW05/soap/features/transaction/">no</saptrhnw05:required>
  <saprmnw05:enableWSRM xmlns:saprmnw05="http://www.sap.com/NW05/soap/features/wsrm/">false</saprmnw05:enableWSRM>
 </wsp:Policy>
 <wsp:Policy wsu:Id="OP_IF_OP_consultarFechaRecepcionSii">
  <sapcomhnd:enableCommit xmlns:sapcomhnd="http://www.sap.com/NW05/soap/features/commit/">false</sapcomhnd:enableCommit>
  <sapblock:enableBlocking xmlns:sapblock="http://www.sap.com/NW05/soap/features/blocking/">true</sapblock:enableBlocking>
  <saptrhnw05:required xmlns:saptrhnw05="http://www.sap.com/NW05/soap/features/transaction/">no</saptrhnw05:required>
  <saprmnw05:enableWSRM xmlns:saprmnw05="http://www.sap.com/NW05/soap/features/wsrm/">false</saprmnw05:enableWSRM>
 </wsp:Policy>
 <wsp:Policy wsu:Id="OP_IF_OP_getVersion">
  <sapcomhnd:enableCommit xmlns:sapcomhnd="http://www.sap.com/NW05/soap/features/commit/">false</sapcomhnd:enableCommit>
  <sapblock:enableBlocking xmlns:sapblock="http://www.sap.com/NW05/soap/features/blocking/">true</sapblock:enableBlocking>
  <saptrhnw05:required xmlns:saptrhnw05="http://www.sap.com/NW05/soap/features/transaction/">no</saptrhnw05:required>
  <saprmnw05:enableWSRM xmlns:saprmnw05="http://www.sap.com/NW05/soap/features/wsrm/">false</saprmnw05:enableWSRM>
 </wsp:Policy>
 <wsp:Policy wsu:Id="OP_IF_OP_ingresarAceptacionReclamoDoc">
  <sapcomhnd:enableCommit xmlns:sapcomhnd="http://www.sap.com/NW05/soap/features/commit/">false</sapcomhnd:enableCommit>
  <sapblock:enableBlocking xmlns:sapblock="http://www.sap.com/NW05/soap/features/blocking/">true</sapblock:enableBlocking>
  <saptrhnw05:required xmlns:saptrhnw05="http://www.sap.com/NW05/soap/features/transaction/">no</saptrhnw05:required>
  <saprmnw05:enableWSRM xmlns:saprmnw05="http://www.sap.com/NW05/soap/features/wsrm/">false</saprmnw05:enableWSRM>
 </wsp:Policy>
 <wsp:Policy wsu:Id="OP_IF_OP_listarEventosHistDoc">
  <sapcomhnd:enableCommit xmlns:sapcomhnd="http://www.sap.com/NW05/soap/features/commit/">false</sapcomhnd:enableCommit>
  <sapblock:enableBlocking xmlns:sapblock="http://www.sap.com/NW05/soap/features/blocking/">true</sapblock:enableBlocking>
  <saptrhnw05:required xmlns:saptrhnw05="http://www.sap.com/NW05/soap/features/transaction/">no</saptrhnw05:required>
  <saprmnw05:enableWSRM xmlns:saprmnw05="http://www.sap.com/NW05/soap/features/wsrm/">false</saprmnw05:enableWSRM>
 </wsp:Policy>
 <wsdl:types>
  <xsd:schema targetNamespace="http://ws.registroreclamodte.diii.sdi.sii.cl" xmlns="http://ws.registroreclamodte.diii.sdi.sii.cl">
   <xsd:element name="Exception" type="Exception"/>
   <xsd:element name="consultarDocDteCedible">
    <xsd:complexType>
     <xsd:sequence>
      <xsd:element name="rutEmisor" type="xsd:string"/>
      <xsd:element name="dvEmisor" type="xsd:string"/>
      <xsd:element name="tipoDoc" type="xsd:string"/>
      <xsd:element name="folio" type="xsd:string"/>
     </xsd:sequence>
    </xsd:complexType>
   </xsd:element>
   <xsd:element name="consultarDocDteCedibleResponse">
    <xsd:complexType>
     <xsd:sequence>
      <xsd:element name="return" type="respuestaTo"/>
     </xsd:sequence>
    </xsd:complexType>
   </xsd:element>
   <xsd:element name="consultarFechaRecepcionSii">
    <xsd:complexType>
     <xsd:sequence>
      <xsd:element name="rutEmisor" type="xsd:string"/>
      <xsd:element name="dvEmisor" type="xsd:string"/>
      <xsd:element name="tipoDoc" type="xsd:string"/>
      <xsd:element name="folio" type="xsd:string"/>
     </xsd:sequence>
    </xsd:complexType>
   </xsd:element>
   <xsd:element name="consultarFechaRecepcionSiiResponse">
    <xsd:complexType>
     <xsd:sequence>
      <xsd:element name="return" type="xsd:string"/>
     </xsd:sequence>
    </xsd:complexType>
   </xsd:element>
   <xsd:element name="getVersion">
    <xsd:complexType/>
   </xsd:element>
   <xsd:element name="getVersionResponse">
    <xsd:complexType>
     <xsd:sequence>
      <xsd:element name="return" type="xsd:string"/>
     </xsd:sequence>
    </xsd:complexType>
   </xsd:element>
   <xsd:element name="ingresarAceptacionReclamoDoc">
    <xsd:complexType>
     <xsd:sequence>
      <xsd:element name="rutEmisor" type="xsd:string"/>
      <xsd:element name="dvEmisor" type="xsd:string"/>
      <xsd:element name="tipoDoc" type="xsd:string"/>
      <xsd:element name="folio" type="xsd:string"/>
      <xsd:element name="accionDoc" type="xsd:string"/>
     </xsd:sequence>
    </xsd:complexType>
   </xsd:element>
   <xsd:element name="ingresarAceptacionReclamoDocResponse">
    <xsd:complexType>
     <xsd:sequence>
      <xsd:element name="return" type="respuestaTo"/>
     </xsd:sequence>
    </xsd:complexType>
   </xsd:element>
   <xsd:element name="listarEventosHistDoc">
    <xsd:complexType>
     <xsd:sequence>
      <xsd:element name="rutEmisor" type="xsd:string"/>
      <xsd:element name="dvEmisor" type="xsd:string"/>
      <xsd:element name="tipoDoc" type="xsd:string"/>
      <xsd:element name="folio" type="xsd:string"/>
     </xsd:sequence>
    </xsd:complexType>
   </xsd:element>
   <xsd:element name="listarEventosHistDocResponse">
    <xsd:complexType>
    	<xsd:sequence>
    		<xsd:element name="Response">
    			<xsd:complexType>
    				<xsd:sequence>
    					<xsd:element name="Return" type="respuestaTo" maxOccurs="1" minOccurs="0">
    					</xsd:element>
                                    <xsd:element name="Error" type="ErrorType" maxOccurs="unbounded" minOccurs="0">
    					</xsd:element>
                                    <xsd:element name="EncodedZippedResponse"
    						type="xsd:base64Binary" maxOccurs="1" minOccurs="0">
    					</xsd:element>
    				</xsd:sequence>
    			</xsd:complexType></xsd:element>
    	</xsd:sequence>
    </xsd:complexType>
   </xsd:element>
   <xsd:complexType name="Exception">
    <xsd:sequence>
     <xsd:element name="message" minOccurs="0" type="xsd:string"/>
    </xsd:sequence>
   </xsd:complexType>
   <xsd:complexType name="respuestaTo">
    <xsd:sequence>
    	<xsd:element name="codResp" minOccurs="0" type="xsd:int" />
    	<xsd:element name="descResp" minOccurs="0"
    		type="xsd:string" />
    </xsd:sequence>
   </xsd:complexType>
  
   <xsd:complexType name="ErrorType">
   	<xsd:sequence>
   		<xsd:element name="ErrorCode" type="xsd:string" maxOccurs="1" minOccurs="0"></xsd:element>
   		<xsd:element name="ErrorDescription" type="xsd:string" maxOccurs="1" minOccurs="0"></xsd:element>
   	</xsd:sequence>
   </xsd:complexType>
  </xsd:schema>
 </wsdl:types>
 <wsdl:message name="consultarDocDteCedible">
  <wsdl:part name="consultarDocDteCedible" element="tns:consultarDocDteCedible"/>
 </wsdl:message>
 <wsdl:message name="consultarDocDteCedibleResponse">
  <wsdl:part name="consultarDocDteCedibleResponse" element="tns:consultarDocDteCedibleResponse"/>
 </wsdl:message>
 <wsdl:message name="consultarFechaRecepcionSii">
  <wsdl:part name="consultarFechaRecepcionSii" element="tns:consultarFechaRecepcionSii"/>
 </wsdl:message>
 <wsdl:message name="consultarFechaRecepcionSiiResponse">
  <wsdl:part name="consultarFechaRecepcionSiiResponse" element="tns:consultarFechaRecepcionSiiResponse"/>
 </wsdl:message>
 <wsdl:message name="Exception">
  <wsdl:part name="Exception" element="tns:Exception"/>
 </wsdl:message>
 <wsdl:message name="getVersion">
  <wsdl:part name="getVersion" element="tns:getVersion"/>
 </wsdl:message>
 <wsdl:message name="getVersionResponse">
  <wsdl:part name="getVersionResponse" element="tns:getVersionResponse"/>
 </wsdl:message>
 <wsdl:message name="ingresarAceptacionReclamoDoc">
  <wsdl:part name="ingresarAceptacionReclamoDoc" element="tns:ingresarAceptacionReclamoDoc"/>
 </wsdl:message>
 <wsdl:message name="ingresarAceptacionReclamoDocResponse">
  <wsdl:part name="ingresarAceptacionReclamoDocResponse" element="tns:ingresarAceptacionReclamoDocResponse"/>
 </wsdl:message>
 <wsdl:message name="listarEventosHistDoc">
  <wsdl:part name="listarEventosHistDoc" element="tns:listarEventosHistDoc"/>
 </wsdl:message>
 <wsdl:message name="listarEventosHistDocResponse">
  <wsdl:part name="listarEventosHistDocResponse" element="tns:listarEventosHistDocResponse"/>
 </wsdl:message>
 <wsdl:portType name="RegistroReclamoDteService">
  <wsdl:documentation>
   <sapdoc:sapdoc xmlns:sapdoc="urn:sap:esi:documentation">
    <sapdoc:docitem applicationComponent="CA-GTF-CSC-EDO-CL"/>
   </sapdoc:sapdoc>
  </wsdl:documentation>
  <wsp:Policy>
   <wsp:PolicyReference URI="#IF_IF_RegistroReclamoDteService"/>
  </wsp:Policy>
  <wsdl:operation name="consultarDocDteCedible">
   <wsp:Policy>
    <wsp:PolicyReference URI="#OP_IF_OP_consultarDocDteCedible"/>
   </wsp:Policy>
   <wsdl:input message="tns:consultarDocDteCedible"/>
   <wsdl:output message="tns:consultarDocDteCedibleResponse"/>
  </wsdl:operation>
  <wsdl:operation name="consultarFechaRecepcionSii">
   <wsp:Policy>
    <wsp:PolicyReference URI="#OP_IF_OP_consultarFechaRecepcionSii"/>
   </wsp:Policy>
   <wsdl:input message="tns:consultarFechaRecepcionSii"/>
   <wsdl:output message="tns:consultarFechaRecepcionSiiResponse"/>
   <wsdl:fault name="Exception" message="tns:Exception"/>
  </wsdl:operation>
  <wsdl:operation name="getVersion">
   <wsp:Policy>
    <wsp:PolicyReference URI="#OP_IF_OP_getVersion"/>
   </wsp:Policy>
   <wsdl:input message="tns:getVersion"/>
   <wsdl:output message="tns:getVersionResponse"/>
  </wsdl:operation>
  <wsdl:operation name="ingresarAceptacionReclamoDoc">
   <wsp:Policy>
    <wsp:PolicyReference URI="#OP_IF_OP_ingresarAceptacionReclamoDoc"/>
   </wsp:Policy>
   <wsdl:input message="tns:ingresarAceptacionReclamoDoc"/>
   <wsdl:output message="tns:ingresarAceptacionReclamoDocResponse"/>
   <wsdl:fault name="Exception" message="tns:Exception"/>
  </wsdl:operation>
  <wsdl:operation name="listarEventosHistDoc">
   <wsp:Policy>
    <wsp:PolicyReference URI="#OP_IF_OP_listarEventosHistDoc"/>
   </wsp:Policy>
   <wsdl:input message="tns:listarEventosHistDoc"/>
   <wsdl:output message="tns:listarEventosHistDocResponse"/>
  </wsdl:operation>
 </wsdl:portType>
</wsdl:definitions>
